---
kind: other
id: Properties.T:Autodesk.Revit.DB.DirectContext3D.VertexPosition
source: html/67d3486a-7766-b003-f6b1-5ebf8e27fc4a.htm
---
# VertexPosition Properties

Specifies whether the .NET object represents a valid Revit entity.